app/controllers/books_controller.rb

  def create
    @book = Book.new(title: params[:book][:title], author: params[:book][:author], price: params[:book][:price].to_f, publishedDate: params[:book][:publishedDate])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "price", "publishedDate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "pdf"], ["author", "dfs"], ["price", "123.0"], ["publishedDate", "2022-02-18"], ["created_at", "2022-02-04 04:00:26.689510"], ["updated_at", "2022-02-04 04:00:26.689510"]]

  def update
    respond_to do |format|
      if @book.update(title: params[:book][:title], author: params[:book][:author], price: params[:book][:price].to_f, publishedDate: params[:book][:publishedDate])
---
UPDATE "books" SET "author" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["author", "Bobee"], ["updated_at", "2022-02-03 22:46:38.785982"], ["id", 13]]