app/controllers/students_controller.rb

  def index
    @students = Student.order(:first)
---
SELECT "students".* FROM "students" ORDER BY "students"."first" ASC

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("first", "last", "number", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first", "Josephina"], ["last", "Phina"], ["number", "12312341234"], ["email", "practice@gmail.com"], ["created_at", "2022-02-07 02:54:12.938122"], ["updated_at", "2022-02-07 02:54:12.938122"]]

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "number" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["number", "1231231234"], ["updated_at", "2022-02-07 02:55:13.819552"], ["id", 2]]