app/models/student.rb

  def self.import(file)
    spreadsheet = open_spreadsheet(file)
    header = spreadsheet.row(1)
    (2..spreadsheet.last_row).each do |i|
      row = Hash[[header, spreadsheet.row(i)].transpose]
      student = find_by_number(row["number"]) || new
      student.attributes = row.to_hash.slice(*row.to_hash.keys)
      student.save!
---
INSERT INTO "students" ("first", "last", "number", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first", "Jorge"], ["last", "Vasquez"], ["number", "4444444444"], ["email", "example@gmail.com"], ["created_at", "2022-02-07 03:55:21.031318"], ["updated_at", "2022-02-07 03:55:21.031318"]]